*** WebDev
    #+begin_src emacs-lisp
      ;; https://gist.github.com/CodyReichert/9dbc8bd2a104780b64891d8736682cea  
      (use-package web-mode)
      (add-to-list 'auto-mode-alist '("\\.jsx?$" . web-mode))
      (setq web-mode-content-types-alist '(("jsx" . "\\.js[x]?\\'")))

      (defun web-mode-init-hook ()
        "Hooks for Web mode.  Adjust indent."
        (setq web-mode-markup-indent-offset 4))
      (add-hook 'web-mode-hook  'web-mode-init-hook)

      (setq-default flycheck-disabled-checkers
                (append flycheck-disabled-checkers
                        '(javascript-jshint json-jsonlist)))
      (flycheck-add-mode 'javascript-eslint 'web-mode) 

      
      (use-package prettier-js)
      (use-package add-node-modules-path)

      (add-hook 'web-mode-hook  'web-mode-init-prettier-hook)
      
      (use-package emmet-mode)
      (add-hook 'web-mode-hook  'emmet-mode)
    #+end_src

    #+RESULTS:
    | emmet-mode | web-mode-init-prettier-hook | web-mode-init-hook |
    
